blog/content/post/ai-speech-and-audio.org
+++
title = "06 - AI Engineering from scratch: do microfone ao assistente de voz"
description = "Como som vira texto, texto vira voz, e voz vira conversa em tempo real"
date = 2026-05-27T14:00:00-03:00
tags = ["AI", "speech", "audio", "asr", "tts", "whisper", "voice-cloning", "python"]
draft = true
weight = 1
author = "Vitor Lobo Ramos"
+++


Som é vibração no ar. Um microfone converte vibração em voltagem. Um conversor analógico-digital amostra essa voltagem 16 mil vezes por segundo. Cada amostra é um float32. Um segundo de áudio são 16 mil floats. Cinco minutos, 4.8 milhões. E em cima dessa montanha de números a gente constrói modelos que transcrevem reuniões, clonam vozes, geram música e conduzem conversas em tempo real.

Processamento de fala e áudio é o campo que fecha o ciclo da comunicação humano-máquina. Texto vai pra voz (TTS). Voz vai pra texto (ASR). E o ciclo inteiro roda em 200 milissegundos pra simular uma conversa natural. Este artigo percorre 17 tópicos, dos fundamentos de áudio digital até assistentes de voz com interrupção em tempo real. A stack é Python pra experimentação e Go pra servir modelos em produção.

* Como som vira número

Antes de qualquer rede neural, o áudio precisa virar tensor. E a conversão tem mais etapas do que parece.

** Do microfone ao waveform

O teorema de Nyquist-Shannon diz que você precisa amostrar pelo menos duas vezes a frequência máxima que quer capturar. Voz humana tem conteúdo relevante até ~8 kHz, então 16 kHz é o padrão pra ASR (Speech Recognition). Música vai até 20 kHz, então 44.1 kHz ou 48 kHz é o padrão. O erro número um em áudio: passar um arquivo de 44.1 kHz estéreo pra um modelo que espera 16 kHz mono. O modelo não reclama. Ele produz lixo silenciosamente.

O waveform é um array 1D de floats entre -1 e 1. Cada valor é a pressão sonora naquele instante. Mas redes neurais não entendem waveform diretamente: as frequências importam mais que as amplitudes instantâneas. Você precisa revelar a estrutura de frequência.

A Short-Time Fourier Transform (STFT) resolve isso. Fatia o áudio em janelas sobrepostas de ~25 ms (400 amostras a 16 kHz), aplica uma janela de Hann pra suavizar as bordas (evitando artefatos espectrais), e roda a FFT em cada fatia. O resultado é um espectrograma: uma matriz tempo x frequência onde cada célula é a energia naquela frequência naquele instante.

** Mel spectrogram: a representação universal de 2026

O espectrograma bruto tem muitas frequências (201 bins pra FFT de 400 pontos). Mas o ouvido humano não percebe frequências linearmente: a diferença entre 100 Hz e 200 Hz é gritante; entre 5100 Hz e 5200 Hz é imperceptível. A escala mel modela isso: ~m = 2595 * log10(1 + f/700)~. Filtros triangulares espaçados na escala mel, aplicados sobre o espectrograma, produzem 80 bandas perceptualmente relevantes. Depois, log-compressão (porque ouvido é logarítmico) e você tem um log-mel spectrogram.

Todo modelo de fala em 2026 usa 80 log-mels a 10 ms de hop como entrada. Whisper, Parakeet, SeamlessM4T, todos. MFCCs (Discrete Cosine Transform sobre log-mels) ainda são usados pra keyword spotting em dispositivos minúsculos, mas são o passado. O futuro é log-mel.

#+BEGIN_SRC python
import torchaudio
import torchaudio.transforms as T

waveform, sr = torchaudio.load("audio.wav")
if sr != 16000:
    waveform = T.Resample(sr, 16000)(waveform)

mel = T.MelSpectrogram(sample_rate=16000, n_mels=80, n_fft=400, hop_length=160)
log_mel = torch.log(mel(waveform) + 1e-6)  # (80, T)
#+END_SRC

* Entendendo o som

Com o áudio convertido em tensor, as mesmas técnicas de visão e NLP se aplicam. Um espectrograma é uma imagem de 1 canal. Uma sequência de frames mel é uma sequência temporal.

** Classificação de áudio

Classificar eventos sonoros ("latido de cachorro", "sirene", "vidro quebrando") segue o mesmo arco das CNNs pra imagem. Baseline dos anos 90: k-NN sobre estatísticas de MFCC. Depois, CNN 2D sobre log-mels (trate o espectrograma como imagem). Depois, Audio Spectrogram Transformer (ViT sobre patches do mel). E em 2026, BEATs: um backbone pré-treinado com aprendizado auto-supervisionado (Bidirectional Encoder representation from Audio Transformers), fine-tunado com 1-10% de dados rotulados.

O SpecAugment é o data augmentation padrão: mascare faixas de tempo e faixas de frequência aleatoriamente durante o treino. O modelo aprende a ser robusto a oclusões. Mixup interpola duas amostras de áudio e seus rótulos, forçando fronteiras de decisão suaves. O problema real é desbalanceamento de classes: "silêncio" aparece 100x mais que "vidro quebrando". Sem balanced sampling, o modelo aprende a dizer "silêncio" pra tudo.

