ai-speech-and-audio/index.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="icon" href="data:,">
  <title>06 - AI Engineering from scratch: do microfone ao assistente de voz — lobovit</title>
  <link rel="stylesheet" href="/css/main.css?v=3">
  <link rel="stylesheet" href="/vendor/fonts/fonts.css">
  <link rel="stylesheet" href="/vendor/prism/prism-mocha.min.css">
</head>
<body>
  <div class="frame">
    <header>
      <nav>
        <a class="site-title" href="https://lobovit.github.io/">lobovit</a>
        <span class="nav-links">
          <a href="/page/about/">about</a>
          <a href="/page/contact/">contact</a>
        </span>
      </nav>
      <hr>
    </header>
    <main>
      
<article>
  <header>
    <h1>06 - AI Engineering from scratch: do microfone ao assistente de voz</h1>
    <p class="meta"><time>2026-05-27</time> · <span class="tag">AI</span><span class="tag">speech</span><span class="tag">audio</span><span class="tag">asr</span><span class="tag">tts</span><span class="tag">whisper</span><span class="tag">voice-cloning</span><span class="tag">python</span></p>
  </header>
  <div class="content">
    
<p>
Som é vibração no ar. Um microfone converte vibração em voltagem. Um conversor analógico-digital amostra essa voltagem 16 mil vezes por segundo. Cada amostra é um float32. Um segundo de áudio são 16 mil floats. Cinco minutos, 4.8 milhões. E em cima dessa montanha de números a gente constrói modelos que transcrevem reuniões, clonam vozes, geram música e conduzem conversas em tempo real.</p>
<p>
Processamento de fala e áudio é o campo que fecha o ciclo da comunicação humano-máquina. Texto vai pra voz (TTS). Voz vai pra texto (ASR). E o ciclo inteiro roda em 200 milissegundos pra simular uma conversa natural. Este artigo percorre 17 tópicos, dos fundamentos de áudio digital até assistentes de voz com interrupção em tempo real. A stack é Python pra experimentação e Go pra servir modelos em produção.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Como som vira número
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
Antes de qualquer rede neural, o áudio precisa virar tensor. E a conversão tem mais etapas do que parece.</p>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Do microfone ao waveform
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
O teorema de Nyquist-Shannon diz que você precisa amostrar pelo menos duas vezes a frequência máxima que quer capturar. Voz humana tem conteúdo relevante até ~8 kHz, então 16 kHz é o padrão pra ASR (Speech Recognition). Música vai até 20 kHz, então 44.1 kHz ou 48 kHz é o padrão. O erro número um em áudio: passar um arquivo de 44.1 kHz estéreo pra um modelo que espera 16 kHz mono. O modelo não reclama. Ele produz lixo silenciosamente.</p>
<p>
O waveform é um array 1D de floats entre -1 e 1. Cada valor é a pressão sonora naquele instante. Mas redes neurais não entendem waveform diretamente: as frequências importam mais que as amplitudes instantâneas. Você precisa revelar a estrutura de frequência.</p>
<p>
A Short-Time Fourier Transform (STFT) resolve isso. Fatia o áudio em janelas sobrepostas de ~25 ms (400 amostras a 16 kHz), aplica uma janela de Hann pra suavizar as bordas (evitando artefatos espectrais), e roda a FFT em cada fatia. O resultado é um espectrograma: uma matriz tempo x frequência onde cada célula é a energia naquela frequência naquele instante.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Mel spectrogram: a representação universal de 2026
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
O espectrograma bruto tem muitas frequências (201 bins pra FFT de 400 pontos). Mas o ouvido humano não percebe frequências linearmente: a diferença entre 100 Hz e 200 Hz é gritante; entre 5100 Hz e 5200 Hz é imperceptível. A escala mel modela isso: <code>m = 2595 * log10(1 + f/700)</code>. Filtros triangulares espaçados na escala mel, aplicados sobre o espectrograma, produzem 80 bandas perceptualmente relevantes. Depois, log-compressão (porque ouvido é logarítmico) e você tem um log-mel spectrogram.</p>
<p>
Todo modelo de fala em 2026 usa 80 log-mels a 10 ms de hop como entrada. Whisper, Parakeet, SeamlessM4T, todos. MFCCs (Discrete Cosine Transform sobre log-mels) ainda são usados pra keyword spotting em dispositivos minúsculos, mas são o passado. O futuro é log-mel.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">torchaudio</span>
</span></span><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">torchaudio.transforms</span> <span class="k">as</span> <span class="nn">T</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">waveform</span><span class="p">,</span> <span class="n">sr</span> <span class="o">=</span> <span class="n">torchaudio</span><span class="o">.</span><span class="n">load</span><span class="p">(</span><span class="s2">&#34;audio.wav&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="k">if</span> <span class="n">sr</span> <span class="o">!=</span> <span class="mi">16000</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">    <span class="n">waveform</span> <span class="o">=</span> <span class="n">T</span><span class="o">.</span><span class="n">Resample</span><span class="p">(</span><span class="n">sr</span><span class="p">,</span> <span class="mi">16000</span><span class="p">)(</span><span class="n">waveform</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">mel</span> <span class="o">=</span> <span class="n">T</span><span class="o">.</span><span class="n">MelSpectrogram</span><span class="p">(</span><span class="n">sample_rate</span><span class="o">=</span><span class="mi">16000</span><span class="p">,</span> <span class="n">n_mels</span><span class="o">=</span><span class="mi">80</span><span class="p">,</span> <span class="n">n_fft</span><span class="o">=</span><span class="mi">400</span><span class="p">,</span> <span class="n">hop_length</span><span class="o">=</span><span class="mi">160</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">log_mel</span> <span class="o">=</span> <span class="n">torch</span><span class="o">.</span><span class="n">log</span><span class="p">(</span><span class="n">mel</span><span class="p">(</span><span class="n">waveform</span><span class="p">)</span> <span class="o">+</span> <span class="mf">1e-6</span><span class="p">)</span>  <span class="c1"># (80, T)</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Entendendo o som
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>
Com o áudio convertido em tensor, as mesmas técnicas de visão e NLP se aplicam. Um espectrograma é uma imagem de 1 canal. Uma sequência de frames mel é uma sequência temporal.</p>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Classificação de áudio
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
Classificar eventos sonoros (&#34;latido de cachorro&#34;, &#34;sirene&#34;, &#34;vidro quebrando&#34;) segue o mesmo arco das CNNs pra imagem. Baseline dos anos 90: k-NN sobre estatísticas de MFCC. Depois, CNN 2D sobre log-mels (trate o espectrograma como imagem). Depois, Audio Spectrogram Transformer (ViT sobre patches do mel). E em 2026, BEATs: um backbone pré-treinado com aprendizado auto-supervisionado (Bidirectional Encoder representation from Audio Transformers), fine-tunado com 1-10% de dados rotulados.</p>
<p>
O SpecAugment é o data augmentation padrão: mascare faixas de tempo e faixas de frequência aleatoriamente durante o treino. O modelo aprende a ser robusto a oclusões. Mixup interpola duas amostras de áudio e seus rótulos, forçando fronteiras de decisão suaves. O problema real é desbalanceamento de classes: &#34;silêncio&#34; aparece 100x mais que &#34;vidro quebrando&#34;. Sem balanced sampling, o modelo aprende a dizer &#34;silêncio&#34; pra tudo.</p>
</div>
</div>
