ai-speech-and-audio/index.html
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
ASR: de áudio pra texto
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
Automatic Speech Recognition (ASR) enfrenta um problema de alinhamento: a entrada tem T frames de áudio (milhares), a saída tem N tokens de texto (dezenas). T != N. Três paradigmas resolvem isso.</p>
<p>
CTC (Connectionist Temporal Classification) produz uma distribuição de probabilidade por frame sobre caracteres + um token especial &#34;blank&#34;. Todos os alinhamentos possíveis que colapsam no texto alvo são marginalizados. A decodificação greedy remove blanks e merge repetições. Beam search melhora ~2% de WER explorando múltiplos caminhos em paralelo.</p>
<p>
RNN-T adiciona um predictor network: além do encoder acústico, uma rede separada modela a probabilidade de transição entre tokens. Isso permite streaming (não precisa esperar o áudio inteiro) e integra um modelo de língua implícito.</p>
<p>
Attention encoder-decoder (Whisper, o padrão de 2026) trata ASR como tradução de áudio pra texto. O encoder comprime log-mels em hidden states. O decoder gera tokens autoregressivamente com cross-attention sobre os estados do encoder. Qualidade offline imbatível (~1.6% WER no inglês com Whisper large-v3-turbo), mas não é streamable (precisa de 30 segundos de contexto).</p>
<p>
Word Error Rate (WER) é a métrica universal: <code>(substituições + deleções + inserções) / palavras de referência</code>. WER de 5% é aceitável; 1-2% é estado da arte; acima de 20% é frustrante pro usuário.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Whisper: a arquitetura que domina 2026
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
Whisper é um transformer encoder-decoder treinado em 680 mil horas de áudio multilíngue fracamente supervisionado. A entrada são 80 canais log-mel em janelas de 30 segundos. Tokens especiais de prompt (<code>&lt;|en|&gt;&lt;|transcribe|&gt;</code>) controlam tarefa e idioma sem fine-tuning.</p>
<p>
O encoder tem 32 camadas transformer com convolução inicial pra downsampling (reduz a dimensão temporal em 2x). O decoder é causal com cross-attention. O vocabulário BPE de 51k tokens inclui tokens de timestamp pra alinhamento temporal. A variante Turbo usa 4 camadas no decoder (8x mais rápido) com perda mínima de qualidade.</p>
<p>
Fine-tuning com LoRA: adicione adaptadores de baixo posto (rank 8-16) nas projeções de query e value do encoder. Congele o decoder. Com menos de 10 horas de dados, congele o encoder também. Ajuste ~0.3% dos parâmetros. O resultado é adaptação de domínio (jargão médico, sotaque regional, terminologia técnica) por uma fração do custo de treino completo.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Reconhecimento de locutor
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
&#34;Quem falou?&#34; é resolvido com embeddings. O ECAPA-TDNN (1D convolutions + squeeze-excitation + attention pooling, 15 milhões de parâmetros) produz um embedding de 192 dimensões que captura as características únicas da voz: trato vocal, pitch médio, padrão de formantes. Treinado com Additive Angular Margin softmax no VoxCeleb (7 mil celebridades, 1 milhão de utterances).</p>
<p>
O enrollment grava 3-5 amostras limpas do locutor-alvo e tira a média dos embeddings. A verificação compara o embedding de uma nova amostra com o embedding enrolado via similaridade de cosseno. Um threshold calibrado decide &#34;mesma pessoa&#34; ou &#34;pessoa diferente&#34;. EER (Equal Error Rate, onde falsos positivos = falsos negativos) é a métrica universal. O estado da arte em 2026 é 0.39% de EER.</p>
<p>
Channel mismatch mata a performance silenciosamente. Microfone do laptop vs celular vs sala de reunião produzem embeddings diferentes pra mesma pessoa. Sempre calibre thresholds no domínio-alvo. L2-normalize embeddings antes da similaridade de cosseno.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
Gerando voz e música
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>
Se ASR é áudio para texto, TTS é texto para áudio. E o arco de maturidade é similar: pipelines de três estágios foram colapsando em modelos ponta a ponta.</p>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Text-to-Speech (TTS)
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>
O pipeline clássico: frontend de texto (converte grafemas em fonemas: &#34;casa&#34; = <em>k</em> <em>a</em> <em>z</em> <em>a</em>), modelo acústico (texto para mel spectrogram), vocoder (mel para waveform). Tacotron 2 (2017) foi o baseline autoregressivo. FastSpeech 2 (2020) removeu a autoregressão com um duration predictor explícito, ficando 10x mais rápido. VITS (2021) unificou encoder, flow normalizador e vocoder GAN num único modelo end-to-end.</p>
<p>
Em 2026, dois modelos dominam. F5-TTS (flow-matching diffusion) atinge 3.95 UTMOS de naturalidade com capacidade de clonagem zero-shot. Kokoro (82 milhões de parâmetros) roda em CPU em tempo real com latência de primeira amostra de 100 ms. O vocoder padrão é HiFi-GAN: uma GAN que upsampleia o mel spectrogram pra waveform em múltiplos estágios, cada um refinando a resolução.</p>
<p>
Sempre normalize o texto antes de fonemizar (expanda números, abreviações, símbolos). Sempre clipe a saída do vocoder em [-1, 1]. Sempre avalie com MOS (escala 1-5 de naturalidade) + SECS (similaridade de timbre com o locutor original) + WER de round-trip (transcreva o áudio gerado e compare com o texto original).</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Clonagem e conversão de voz
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>
Clonagem zero-shot: 5 segundos de áudio de referência, um speaker encoder extrai um embedding, o decoder de TTS condiciona nesse embedding + texto. O F5-TTS atinge SECS 0.72 (onde 1.0 é identidade perfeita e 0.3 é aleatório).</p>
<p>
Voice conversion troca o locutor mantendo o conteúdo: &#34;minhas palavras na sua voz&#34;. Três abordagens. Recognition-synthesis: um ASR extrai conteúdo fonético (PPGs, Posterior Probability Grams), um vocoder condicionado no locutor-alvo ressintetiza. KNN-VC: substituição não-paramétrica de frames por vizinhos mais próximos num banco de amostras do locutor-alvo (zero treino, qualidade surpreendente). Neural codec TTS (VALL-E): discretize áudio em tokens via EnCodec, modele a sequência com um transformer condicionado no embedding do locutor.</p>
<p>
Em 2026, clonagem de voz é legalmente regulada (EU AI Act, California AB 2905). É obrigatório embutir watermark em todo áudio sintético e implementar gates de consentimento. AudioSeal (Meta) é o padrão de watermarking (veja a seção de anti-spoofing).</p>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Geração de música
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>
Música generativa explodiu entre 2023 e 2026. Modelos abertos (MusicGen, ACE-Step) lidam com instrumentais. Modelos fechados (Suno v5, Udio v4) produzem músicas completas com vocais.</p>
<p>
MusicGen prevê tokens de codec de áudio (EnCodec, 4 codebooks a 32 kHz) autoregressivamente, condicionado em embeddings de texto ou melodia. O condicionamento de melodia usa chromagram (intensidade das 12 notas musicais ao longo do tempo) pra preservar a melodia enquanto muda o timbre.</p>
<p>
ACE-Step XL (4 bilhões de parâmetros, Apache 2.0) é o modelo aberto de 2026 pra geração de música completa. O acordo Warner Music de $500M em 2025 redefiniu as restrições legais: todo modelo generativo de música precisa embarcar watermark e manifesto de proveniência.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
Áudio além da fala
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>
As fronteiras de 2026 expandem áudio pra domínios que vão além de transcrever e sintetizar.</p>
