ai-speech-and-audio/index.html
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
Audio-Language Models (LALMs)
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p>
Um modelo único que raciocina sobre fala, som e música e responde perguntas em texto livre. A arquitetura é um template de três componentes: encoder de áudio (Whisper, BEATs, CLAP, WavLM, frequentemente combinados) + projetor MLP pequeno + LLM congelado ou com LoRA (Llama, Qwen, Gemma).</p>
<p>
O treino tem três estágios: (1) alinhamento (congele encoder e LLM, treine só o projetor em ASR e captioning), (2) pré-treino (descongele tudo, dados intercalados de imagem-texto-áudio), (3) instruction tuning (pares curados de áudio + pergunta + resposta). O Qwen2.5-Omni-7B (Apache 2.0) empata com GPT-4o Audio no benchmark MMAU-Pro (~52% de acurácia). Comparação multi-áudio (dados dois sons, qual é mais agudo? qual tem mais reverberação?) permanece perto de acerto aleatório (~22%) pra todos os modelos em 2026.</p>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
Codecs neurais de áudio
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p>
Discretizar áudio contínuo em tokens discretos é o que permite usar transformers (projetados pra linguagem) pra gerar fala e música. Residual Vector Quantization (RVQ) é a técnica: uma cascata de codebooks pequenos (1024 códigos cada), cada um quantizando o resíduo do anterior. O vocabulário efetivo é de bilhões com apenas 8 codebooks.</p>
<p>
Quatro codecs dominam. EnCodec (Meta, baseline a 75 Hz), DAC (highest fidelity a 86 Hz), SNAC (multi-escala hierárquico, 12 Hz coarse), Mimi (Kyutai, 12.5 Hz, o divisor de águas de 2026). O insight do Mimi: codebook 0 é destilado do WavLM e codifica conteúdo semântico (o que está sendo dito); codebooks 1-7 codificam timbre e prosódia (como está sendo dito). Essa separação semântico-acústica permite clonagem zero-shot: um modelo texto para semântico gera o conteúdo, um modelo semântico para acústico condicionado no locutor gera o timbre.</p>
</div>
</div>
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
Processamento em tempo real
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<p>
O orçamento de latência pra conversa natural é 230 ms (tempo de tomada de turno humano). Cada etapa do pipeline compete por esse orçamento: microfone para VAD (30 ms), ASR (150 ms), LLM primeiro token (100 ms), TTS primeiro chunk (100 ms), alto-falante (20 ms). O total passa de 400 ms. A solução é pipeline assíncrono com resultados parciais. O ASR emite transcrições parciais conforme o áudio chega. O LLM começa a gerar antes do ASR terminar. O TTS começa a sintetizar depois de ~20 tokens do LLM. O resultado é overlapping: o assistente começa a falar enquanto ainda está &#34;pensando&#34; no resto da resposta.</p>
<p>
Ring buffer (fila circular lock-free a cada 20 ms / 320 amostras) é a estrutura de dados central. Silero VAD 4.0 (1 ms por frame, 87.7% TPR a 5% FPR) é o gate que decide quando começa e termina a fala. WebRTC com Opus codec + AEC3 (echo cancellation) é o transporte. O GIL do Python é o gargalo número um: threads de áudio competem com o loop de inferência. Em produção, isole captura de áudio em processos separados.</p>
</div>
</div>
<div id="outline-container-headline-17" class="outline-3">
<h3 id="headline-17">
Pipeline de assistente de voz (capstone)
</h3>
<div id="outline-text-headline-17" class="outline-text-3">
<p>
A integração completa: microfone, VAD, STT, LLM + tools, TTS, alto-falante, com tratamento de interrupção. Sete estágios frouxamente acoplados via filas assíncronas. O VAD (Silero, threshold 0.5, fala mínima 250 ms, hangover de silêncio 500 ms) delimita os turnos do usuário. Whisper ou Parakeet transcreve. O LLM gera tokens com tool calling (timer, clima, calendário). O TTS começa após ~20 tokens do LLM.</p>
<p>
O target é &lt;800 ms de time-to-first-audio-byte num laptop CPU. A stack comercial de 2026: LiveKit (transporte WebRTC) + Deepgram (ASR) + GPT-4o (LLM) + Cartesia (TTS), atingindo 350-500 ms. O Moshi (veja abaixo) oferece alternativa full-duplex a 200 ms.</p>
</div>
</div>
<div id="outline-container-headline-18" class="outline-3">
<h3 id="headline-18">
Streaming speech-to-speech (Moshi, Hibiki)
</h3>
<div id="outline-text-headline-18" class="outline-text-3">
<p>
Abandone o pipeline ASR, LLM, TTS. Um único modelo full-duplex que ouve e fala simultaneamente a 200 ms de latência. O Moshi (7 bilhões de parâmetros, Temporal Transformer) consome dois streams paralelos de codec Mimi a 12.5 Hz x 8 codebooks: o áudio do usuário e o próprio áudio que o Moshi está gerando. A cada 80 ms, o modelo emite três saídas: o próximo token de texto (&#34;inner monologue&#34;, forçando o modelo a modelar linguagem junto com acústica), depois os próximos 8 tokens de codebook de áudio via um transformer raso de depth.</p>
<p>
O inner monologue é o truque. Forçar o modelo a gerar texto intermediário antes do áudio melhora coerência semântica. Os dois streams de áudio paralelos permitem back-channeling (&#34;mhm&#34;, &#34;aham&#34;) e interrupções naturais em tempo real. Moshi ganha em latência e naturalidade de tomada de turno, mas perde em tool calling. Hibiki aplica a mesma arquitetura pra tradução de fala streaming. Pra enterprise (onde tools são necessárias), o pipeline ainda reina.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-19" class="outline-2">
<h2 id="headline-19">
Segurança e avaliação
</h2>
<div id="outline-text-headline-19" class="outline-text-2">
<div id="outline-container-headline-20" class="outline-3">
<h3 id="headline-20">
Anti-spoofing e watermarking
</h3>
<div id="outline-text-headline-20" class="outline-text-3">
<p>
Clonagem de voz chegou antes das defesas. Em 2026, dois sistemas são obrigatórios em produção. Um detector de deepfake (AASIST, graph-attention sobre features espectrais, 7.23% EER no benchmark ASVspoof 5). E um watermark imperceptível embutido em todo áudio sintético (AudioSeal, Meta). AudioSeal usa um gerador e detector treinados conjuntamente. O gerador embute um sinal de ~-40 dB (inaudível) com payload de 16 bits (modelo ID, timestamp, user ID). O detector recupera o sinal frame a frame. Sobrevive a compressão MP3/AAC e variação de mais ou menos 10% de velocidade. Roda 485x mais rápido que tempo real.</p>
<p>
Pitch shift é o ataque universal que enfraquece todas as marcas d&#39;água. Combine detecção com watermarking, nunca um só. C2PA (manifestos criptográficos de proveniência) sozinho é bypassable com re-encode. Sempre combine os três: watermark + detector + C2PA.</p>
</div>
</div>
<div id="outline-container-headline-21" class="outline-3">
<h3 id="headline-21">
VAD e tomada de turno
</h3>
<div id="outline-text-headline-21" class="outline-text-3">
<p>
Toda interação por voz depende de duas decisões a cada 20 ms: tem fala? (VAD) e o usuário terminou? (detecção de fim de turno). A cascata de três níveis: gate de energia (mais barato, threshold -40 dBFS, filtra silêncio absoluto), Silero VAD (1M parâmetros, ~1 ms por frame, decide fala/não-fala com rede neural), detector semântico de turno (MLP sobre palavras recentes + entonação, distingue pausa de meio de frase de fim de turno).</p>
<p>
A máquina de estados: speaking, silence (com hangover configurável de 500-800 ms), pre-roll buffer (300 ms pra evitar cortar a primeira palavra). O Kyutai flush trick: quando o VAD detecta fim de fala, envia um sinal de flush pro ASR streaming, cortando o look-ahead delay de 500 ms pra ~125 ms. Nunca deploye VAD só de energia. Calibre o hangover com usuários reais (idosos fazem pausas mais longas; crianças emendam tudo).</p>
</div>
</div>
